In [31]:
import pandas as pd
import numpy as np
!type example/ex1.csv

命令语法不正确。

In [32]:
df = pd.read_csv('example/ex1.csv')

In [33]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [34]:
pd.read_table('example/ex1.csv', sep = ',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [35]:
# pandas 自动分配列名
pd.read_csv('example/ex2.csv',header = None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [36]:
# 自己指定列名
pd.read_csv('example/ex2.csv', names = ['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [37]:
names = ['a', 'b', 'c', 'd', 'message']

In [38]:
# message 列成为返回DataFrame的索引
pd.read_csv('example/ex2.csv', names = names, index_col = 'message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [39]:
parsed = pd.read_csv('example/csv_mindex.csv', index_col = ['key1', 'key2'])

In [40]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [41]:
list(open('example/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [42]:
result = pd.read_table('example/ex3.txt', sep = '\s+')

In [43]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [44]:
type example/ex4.csv

SyntaxError: invalid syntax (1657699518.py, line 1)

In [45]:
# 利用skiprows命令跳过第0 ， 2， 3 行
pd.read_csv('example/ex4.csv', skiprows = [0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [46]:
result = pd.read_csv('example/ex5.csv')

In [47]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [48]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [49]:
# na_values 可以传入一个列表或者一串字符处理缺失值
result = pd.read_csv('example/ex5.csv', na_values = ['NULL'])

In [50]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [51]:
sentinals = {'message':['foo', 'NA'], 'something':['one']}

In [52]:
pd.read_csv('example/ex5.csv', na_values=sentinals)

  something  a   b     c   d message
0       NaN  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [53]:
# 分块读入文本文件
pd.options.display.max_rows = 10
result = pd.read_csv('example/ex6.csv')

In [54]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [55]:
pd.read_csv('example/ex6.csv', nrows = 5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [56]:
chunker = pd.read_csv('example/ex6.csv', chunksize = 1000)

In [57]:
chunker

In [58]:
pd.read_csv('example/ex6.csv', chunksize = 1000)

In [59]:
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value = 0)

In [60]:
tot = tot.sort_values(ascending = False)

In [61]:
tot[:10]

key
E    368
X    364
L    346
O    343
Q    340
M    338
J    337
F    335
K    334
H    330
dtype: object

In [62]:
data = pd.read_csv('example/ex5.csv')

In [63]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [64]:
# 使用to csv 方法，将数据导出为逗号分隔的文件
data.to_csv('example/out.csv')

'cat' 不是内部或外部命令，也不是可运行的程序
或批处理文件。